# Создать пустой список
# Запросить у пользователя число
# Если число больше 20
#    Положить в список
# Вывести список

lista = []

a = int(input())
if a > 20:
    lista.append(a)
print(lista)