#Создать список с именем и возрастом.
#Вывести "My name is <name>, my age is <age>." используя элементы списка.

a = ['Magomet','24']

a[0]
a[1]

print(' My name is ' + a[0] , ' my age is ' + a[1])
