# На ввод дается длина стороны треугольника a и высота треугольника h.
#  Вычислите его площадь S используя формулу S = ½ * a * h. Выведите площадь.

a = int(input())
h = int(input())
S = 1/2 * a * h
print(S)

