# На ввод дается число.
# Вывести True or False если это число находится в диапазоне между 18 и 24.
# Вывести True or False если это число находится вне диапазона между 18 и 24

a = int(input())
print(18 <= a <=24)
print(18 > a or 24 < a)



